{"modelTopology":{"class_name":"Model","config":{"name":"OrganicFlowNN","layers":[{"name":"molecule_reagent_input","class_name":"InputLayer","config":{"batch_input_shape":[null,50],"dtype":"float32","sparse":false,"name":"molecule_reagent_input"},"inbound_nodes":[]},{"name":"reaction_context","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"reaction_context","trainable":true},"inbound_nodes":[[["molecule_reagent_input",0,0,{}]]]},{"name":"transformation","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"transformation","trainable":true},"inbound_nodes":[[["reaction_context",0,0,{}]]]},{"name":"product_assembly","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"product_assembly","trainable":true},"inbound_nodes":[[["transformation",0,0,{}]]]},{"name":"series_output","class_name":"Dense","config":{"units":16,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"series_output","trainable":true},"inbound_nodes":[[["product_assembly",0,0,{}]]]},{"name":"carbon_output","class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"carbon_output","trainable":true},"inbound_nodes":[[["product_assembly",0,0,{}]]]}],"input_layers":[["molecule_reagent_input",0,0]],"output_layers":[["series_output",0,0],["carbon_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"reaction_context/kernel","shape":[50,64],"dtype":"float32"},{"name":"reaction_context/bias","shape":[64],"dtype":"float32"},{"name":"transformation/kernel","shape":[64,32],"dtype":"float32"},{"name":"transformation/bias","shape":[32],"dtype":"float32"},{"name":"product_assembly/kernel","shape":[32,32],"dtype":"float32"},{"name":"product_assembly/bias","shape":[32],"dtype":"float32"},{"name":"series_output/kernel","shape":[32,16],"dtype":"float32"},{"name":"series_output/bias","shape":[16],"dtype":"float32"},{"name":"carbon_output/kernel","shape":[32,10],"dtype":"float32"},{"name":"carbon_output/bias","shape":[10],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}